---
kind: type
id: T:Autodesk.Revit.DB.AdaptivePointConstraintType
source: html/9aa479aa-36be-bf1b-7570-026afcd4d02e.htm
---
# Autodesk.Revit.DB.AdaptivePointConstraintType

An enumerated type containing possible constraint types for Adaptive Points.

## Syntax (C#)
```csharp
public enum AdaptivePointConstraintType
```